<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"51b388d7876950846b828ed242709df3fe54af4e7a9095b9f00c8a783d7aa34e","plan_job_ref":"Job Plan Airflow DAGs #389 at https://github.com/cal-itp/data-infra/actions/runs/16509924972","plan_out_hash":"fbc74a379706ab6c4b3b4a8f224d385b603c383d5fae8b489bbed9616316856c","plan_hash":"b1e2a3e18fc50ea4cab0032503ccfdb073ac054dc9dae989bee1a9ee150e2dec","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 17 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "6sAQZg==" -> (known after apply)
!~      detect_md5hash      = "XpJ8tKiLNLQeAM1YMW8LXQ==" -> "different hash"
!~      generation          = 1753205763664721 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "XpJ8tKiLNLQeAM1YMW8LXQ==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["macros/gtfs_rt_stg_outcomes.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "VEnQbA==" -> (known after apply)
!~      detect_md5hash      = "mAk7HxroRGKrviDdsObAlw==" -> "different hash"
!~      generation          = 1753321617895359 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/macros/gtfs_rt_stg_outcomes.sql"
!~      md5hash             = "mAk7HxroRGKrviDdsObAlw==" -> (known after apply)
        name                = "data/warehouse/macros/gtfs_rt_stg_outcomes.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["macros/gtfs_rt_stg_validation_notices.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "PRMWGQ==" -> (known after apply)
!~      detect_md5hash      = "FI9MAkxi/x0ufm066ibFRg==" -> "different hash"
!~      generation          = 1753321617861423 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/macros/gtfs_rt_stg_validation_notices.sql"
!~      md5hash             = "FI9MAkxi/x0ufm066ibFRg==" -> (known after apply)
        name                = "data/warehouse/macros/gtfs_rt_stg_validation_notices.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/gtfs/fct_service_alerts_messages_unnested.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "iNQ7Lw==" -> (known after apply)
!~      detect_md5hash      = "L96khzO38KHGV21x4CANiA==" -> "different hash"
!~      generation          = 1751416663382256 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/mart/gtfs/fct_service_alerts_messages_unnested.sql"
!~      md5hash             = "L96khzO38KHGV21x4CANiA==" -> (known after apply)
        name                = "data/warehouse/models/mart/gtfs/fct_service_alerts_messages_unnested.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/staging/gtfs/stg_gtfs_rt__service_alerts.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "nxGQRg==" -> (known after apply)
!~      detect_md5hash      = "NmwXArPgOkEKGFW3APzVvQ==" -> "different hash"
!~      generation          = 1753321617902265 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/staging/gtfs/stg_gtfs_rt__service_alerts.sql"
!~      md5hash             = "NmwXArPgOkEKGFW3APzVvQ==" -> (known after apply)
        name                = "data/warehouse/models/staging/gtfs/stg_gtfs_rt__service_alerts.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/staging/gtfs/stg_gtfs_rt__service_alerts_outcomes.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "g7NYyQ==" -> (known after apply)
!~      detect_md5hash      = "Z/pBu7WcX8jnOnNdy+kwQQ==" -> "different hash"
!~      generation          = 1753321617896625 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/staging/gtfs/stg_gtfs_rt__service_alerts_outcomes.sql"
!~      md5hash             = "Z/pBu7WcX8jnOnNdy+kwQQ==" -> (known after apply)
        name                = "data/warehouse/models/staging/gtfs/stg_gtfs_rt__service_alerts_outcomes.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/staging/gtfs/stg_gtfs_rt__trip_updates.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "k2pIpA==" -> (known after apply)
!~      detect_md5hash      = "P+wEzEYp+eGNL9xaNZJ15Q==" -> "different hash"
!~      generation          = 1753321617898850 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/staging/gtfs/stg_gtfs_rt__trip_updates.sql"
!~      md5hash             = "P+wEzEYp+eGNL9xaNZJ15Q==" -> (known after apply)
        name                = "data/warehouse/models/staging/gtfs/stg_gtfs_rt__trip_updates.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/staging/gtfs/stg_gtfs_rt__trip_updates_outcomes.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "FSI7Gg==" -> (known after apply)
!~      detect_md5hash      = "t2jouWuZ/qiG0o2U7RPNyw==" -> "different hash"
!~      generation          = 1753321618147053 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/staging/gtfs/stg_gtfs_rt__trip_updates_outcomes.sql"
!~      md5hash             = "t2jouWuZ/qiG0o2U7RPNyw==" -> (known after apply)
        name                = "data/warehouse/models/staging/gtfs/stg_gtfs_rt__trip_updates_outcomes.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/staging/gtfs/stg_gtfs_rt__vehicle_positions.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "01A2bw==" -> (known after apply)
!~      detect_md5hash      = "Wmj2r+w4gDcDGbtYQH5zvw==" -> "different hash"
!~      generation          = 1753321618117633 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/staging/gtfs/stg_gtfs_rt__vehicle_positions.sql"
!~      md5hash             = "Wmj2r+w4gDcDGbtYQH5zvw==" -> (known after apply)
        name                = "data/warehouse/models/staging/gtfs/stg_gtfs_rt__vehicle_positions.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/staging/gtfs/stg_gtfs_rt__vehicle_positions_outcomes.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "5X8EWQ==" -> (known after apply)
!~      detect_md5hash      = "VmV4oTECImaOT3NumJE3sA==" -> "different hash"
!~      generation          = 1753321617902136 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/staging/gtfs/stg_gtfs_rt__vehicle_positions_outcomes.sql"
!~      md5hash             = "VmV4oTECImaOT3NumJE3sA==" -> (known after apply)
        name                = "data/warehouse/models/staging/gtfs/stg_gtfs_rt__vehicle_positions_outcomes.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/staging/gtfs_quality/stg_gtfs_rt__service_alerts_validation_notices.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "0RKFwQ==" -> (known after apply)
!~      detect_md5hash      = "s3oSLvIOqRwarkYQ3xodsg==" -> "different hash"
!~      generation          = 1753321617895451 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/staging/gtfs_quality/stg_gtfs_rt__service_alerts_validation_notices.sql"
!~      md5hash             = "s3oSLvIOqRwarkYQ3xodsg==" -> (known after apply)
        name                = "data/warehouse/models/staging/gtfs_quality/stg_gtfs_rt__service_alerts_validation_notices.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/staging/gtfs_quality/stg_gtfs_rt__service_alerts_validation_outcomes.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "R/v19A==" -> (known after apply)
!~      detect_md5hash      = "t80b9rkOYo6YMHOesr+6Pg==" -> "different hash"
!~      generation          = 1753321617893622 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/staging/gtfs_quality/stg_gtfs_rt__service_alerts_validation_outcomes.sql"
!~      md5hash             = "t80b9rkOYo6YMHOesr+6Pg==" -> (known after apply)
        name                = "data/warehouse/models/staging/gtfs_quality/stg_gtfs_rt__service_alerts_validation_outcomes.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/staging/gtfs_quality/stg_gtfs_rt__trip_updates_validation_notices.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "urGYUw==" -> (known after apply)
!~      detect_md5hash      = "WZ/uoaPVIWRtDdlm7KpGcw==" -> "different hash"
!~      generation          = 1753321617895391 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/staging/gtfs_quality/stg_gtfs_rt__trip_updates_validation_notices.sql"
!~      md5hash             = "WZ/uoaPVIWRtDdlm7KpGcw==" -> (known after apply)
        name                = "data/warehouse/models/staging/gtfs_quality/stg_gtfs_rt__trip_updates_validation_notices.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/staging/gtfs_quality/stg_gtfs_rt__trip_updates_validation_outcomes.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "cXrYpw==" -> (known after apply)
!~      detect_md5hash      = "PVTU97NPnlC1qKGY4yFPXQ==" -> "different hash"
!~      generation          = 1753321618019332 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/staging/gtfs_quality/stg_gtfs_rt__trip_updates_validation_outcomes.sql"
!~      md5hash             = "PVTU97NPnlC1qKGY4yFPXQ==" -> (known after apply)
        name                = "data/warehouse/models/staging/gtfs_quality/stg_gtfs_rt__trip_updates_validation_outcomes.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/staging/gtfs_quality/stg_gtfs_rt__vehicle_positions_validation_notices.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "Vo5xEg==" -> (known after apply)
!~      detect_md5hash      = "mRPVKhp6BBYvsLvJMBqRIQ==" -> "different hash"
!~      generation          = 1753321617895730 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/staging/gtfs_quality/stg_gtfs_rt__vehicle_positions_validation_notices.sql"
!~      md5hash             = "mRPVKhp6BBYvsLvJMBqRIQ==" -> (known after apply)
        name                = "data/warehouse/models/staging/gtfs_quality/stg_gtfs_rt__vehicle_positions_validation_notices.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/staging/gtfs_quality/stg_gtfs_rt__vehicle_positions_validation_outcomes.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "76sp0w==" -> (known after apply)
!~      detect_md5hash      = "dhvRva3yI+z4zYghRCe6kw==" -> "different hash"
!~      generation          = 1753321618188263 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/staging/gtfs_quality/stg_gtfs_rt__vehicle_positions_validation_outcomes.sql"
!~      md5hash             = "dhvRva3yI+z4zYghRCe6kw==" -> (known after apply)
        name                = "data/warehouse/models/staging/gtfs_quality/stg_gtfs_rt__vehicle_positions_validation_outcomes.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "dgq91A==" -> (known after apply)
!~      detect_md5hash      = "wv+KQdvgaOkZVtoXucgzlw==" -> "different hash"
!~      generation          = 1753205765234099 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "wv+KQdvgaOkZVtoXucgzlw==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 17 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #389](https://github.com/cal-itp/data-infra/actions/runs/16509924972)